### AWS  app plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/757761b4-d19a-47aa-b20d-a91fa3703ad1/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-41cfd9b3.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-41cfd9b3.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/About-41cfd9b3.js"
      + source_hash            = "c7f5ea1ef4f9513680640996d3ed3657"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-0832ce36.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-0832ce36.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/ArticleLayouts-0832ce36.js"
      + source_hash            = "b405602afe9e28dc48e0b719ae1bfedc"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-c07800fd.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-c07800fd.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/Articles-c07800fd.js"
      + source_hash            = "eb2bf38d393e51948a86aacc27026f7b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-cdca7afd.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-cdca7afd.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/Articles-cdca7afd.css"
      + source_hash            = "d254e9f4850a323e5ea30df3ac31964d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-55994a62.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-55994a62.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/Landing-55994a62.css"
      + source_hash            = "b48e92d99a74536053cfb086f1cf666d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-c02f9a13.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-c02f9a13.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/Landing-c02f9a13.js"
      + source_hash            = "a7c0932ab610b7b65295722ff73eb3d0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-2166aad4.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-2166aad4.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/PDF-2166aad4.css"
      + source_hash            = "00fb11129144eb048b60320a1ca0c77b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-7827ee5f.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-7827ee5f.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/PDF-7827ee5f.js"
      + source_hash            = "b30fa77973ee6b6d758eb3dae8f4b0b8"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-1478f226.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-1478f226.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/Start-1478f226.js"
      + source_hash            = "0af1186a2627c444a6a33013e3f9e5d7"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-30662b5b.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartButtonFloat-30662b5b.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/StartButtonFloat-30662b5b.css"
      + source_hash            = "4f9643d47026450c9ee5b6cc273c47c2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-75808506.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartButtonFloat-75808506.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/StartButtonFloat-75808506.js"
      + source_hash            = "d0124d833f2374299044c31bf1a8eed0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-2e2ec67e.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Terminal-2e2ec67e.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/Terminal-2e2ec67e.css"
      + source_hash            = "85561bf1ef41088b8c3f0f50a6a1fa81"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-e654d540.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Terminal-e654d540.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/Terminal-e654d540.js"
      + source_hash            = "4dc5e5a13cc2056d1c06f0ae66219cb9"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/azure_devicon_forest_green-00278e7c.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/azure_devicon_forest_green-00278e7c.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/azure_devicon_forest_green-00278e7c.svg"
      + source_hash            = "e60911495dba8bb96def57539a94e9cf"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bash_devicon_forest_green-d16e0666.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/bash_devicon_forest_green-d16e0666.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/bash_devicon_forest_green-d16e0666.svg"
      + source_hash            = "302f026f7e053d0ccf4b0ed827f15900"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/d3_devicon_forest_green-1e07de82.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/d3_devicon_forest_green-1e07de82.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/d3_devicon_forest_green-1e07de82.svg"
      + source_hash            = "89db6545390762231d3913a3cd717cf3"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-4cbd2440.woff"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "font/woff"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/devicons-4cbd2440.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/devicons-4cbd2440.woff"
      + source_hash            = "a8639dec5833a8375d22fe425b01f4eb"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-880373aa.eot"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/vnd.ms-fontobject"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/devicons-880373aa.eot"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/devicons-880373aa.eot"
      + source_hash            = "36c5ab9318386dc0499a0d89691e6331"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-cbb92633.ttf"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "font/ttf"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/devicons-cbb92633.ttf"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/devicons-cbb92633.ttf"
      + source_hash            = "5ed4d6468a5a0f3cf9c82f854936feab"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-d7c9f264.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/devicons-d7c9f264.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/devicons-d7c9f264.svg"
      + source_hash            = "3364e4c1c38b1d141d6f12a441546cdc"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-2adefcbc.woff2"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "font/woff2"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/fontawesome-webfont-2adefcbc.woff2"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-2adefcbc.woff2"
      + source_hash            = "af7ae505a9eed503f8b8e6982036873e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-7bfcab6d.eot"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/vnd.ms-fontobject"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/fontawesome-webfont-7bfcab6d.eot"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-7bfcab6d.eot"
      + source_hash            = "674f50d287a8c48dc19ba404d20fe713"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-aa58f33f.ttf"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "font/ttf"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/fontawesome-webfont-aa58f33f.ttf"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-aa58f33f.ttf"
      + source_hash            = "b06871f281fee6b241d60582ae9369b9"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ad615792.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/fontawesome-webfont-ad615792.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-ad615792.svg"
      + source_hash            = "8ef356884e8bc0128e25921e21fab64f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ba0c59de.woff"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "font/woff"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/fontawesome-webfont-ba0c59de.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-ba0c59de.woff"
      + source_hash            = "fee66e712a8a08eef5805a46892932ad"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-66b10136.jpg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/jpeg"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/github_profile_pic-66b10136.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/github_profile_pic-66b10136.jpg"
      + source_hash            = "a85d8d094e6d9a7903c5829c0ed09432"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-0a33ed42.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/html2canvas.esm-0a33ed42.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/html2canvas.esm-0a33ed42.js"
      + source_hash            = "955bf9b222a46a0897ad2d52916463de"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-79ca4b23.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-79ca4b23.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/index-79ca4b23.js"
      + source_hash            = "41e7e57859d1482dfb47846133b19216"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-9a0f5c31.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-9a0f5c31.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/index-9a0f5c31.css"
      + source_hash            = "45acb66fcc4bb14921fc31218d5333c0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-2ebeaddd.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-2ebeaddd.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/index.es-2ebeaddd.js"
      + source_hash            = "e278b224581d95c7680b65d5e7dee344"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/powershell_devicon_forest_green-25e7cded.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/powershell_devicon_forest_green-25e7cded.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/powershell_devicon_forest_green-25e7cded.svg"
      + source_hash            = "3af47f89e61fe763b909c1fabc4c4083"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-3ef59d4c.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/purify.es-3ef59d4c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/purify.es-3ef59d4c.js"
      + source_hash            = "f17593fbd13b830e8b0da63f75b8f242"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/recase-b12b8868.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/recase-b12b8868.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/recase-b12b8868.js"
      + source_hash            = "71973ad25d4adfade3bb472a2fd9afd8"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/tableau_logo-c0ec519e.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/tableau_logo-c0ec519e.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/tableau_logo-c0ec519e.svg"
      + source_hash            = "b42fa60cb28ab38ad51179e8b40ff867"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/terraform_devicon_forest_green-e8473ede.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/terraform_devicon_forest_green-e8473ede.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/terraform_devicon_forest_green-e8473ede.svg"
      + source_hash            = "ab25c8b031fc668e363745b71dd395a2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ts_devicon_forest_green-e8483eba.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ts_devicon_forest_green-e8483eba.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/ts_devicon_forest_green-e8483eba.svg"
      + source_hash            = "52658f776f4a1d3b285bc64c540aa7c5"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/vue_devicon_forest_green-d8b386fc.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/vue_devicon_forest_green-d8b386fc.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/assets/vue_devicon_forest_green-d8b386fc.svg"
      + source_hash            = "b445c5110e3b0a783cfb923e99665079"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.ico"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/x-icon"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/favicon.ico"
      + source_hash            = "15789dada2974fe2e62d763285aa97f0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../shortpoet_site/index.html"
      + source_hash            = "addd68c3b53f697e3611492cd5204084"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 39 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket_object_etags       = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + s3_bucket_object_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + s3_bucket_object_keys_ids    = [
      + {
          + id  = (known after apply)
          + key = "assets/About-41cfd9b3.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/ArticleLayouts-0832ce36.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Articles-c07800fd.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Articles-cdca7afd.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Landing-55994a62.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Landing-c02f9a13.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/PDF-2166aad4.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/PDF-7827ee5f.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Start-1478f226.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/StartButtonFloat-30662b5b.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/StartButtonFloat-75808506.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Terminal-2e2ec67e.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Terminal-e654d540.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/azure_devicon_forest_green-00278e7c.svg"
        },
      + {
          + id  = (known after apply)
          + key = "assets/bash_devicon_forest_green-d16e0666.svg"
        },
      + {
          + id  = (known after apply)
          + key = "assets/d3_devicon_forest_green-1e07de82.svg"
        },
      + {
          + id  = (known a
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*